app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT "posts".* FROM "posts"

  def create
    Post.create(title:params[:post][:title], description:[:post][:description])
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2018-07-09 04:32:42.832092"], ["updated_at", "2018-07-09 04:32:42.832092"]]